/*
Во градот постојат 2 такси компании. Едната наплаќа фиксна цена C денари за првите К километри, а за секој нареден километар наплаќа уште P денари. 
Другата такси компанија има возила кои возат со брзина V километри во минута, а наплаќа B денари пред почетокот на возењето, за секој извозен километар
уште D денари и дополнително за секоја минута возење наплаќа М денари. Ваша задача е за даден број на километри до дестинацијата да пресметате со која 
такси компанија најмногу ви се исплати да се возите.

Влез: Во првата линија е даден бројот на километри до дестинацијата. Во наредната линија се дадени C, K и P. Во третата и последна линија се дадени V, B, M и D.

Излез: Во првиот ред се печатат цените на двете компании одвоени со празно место, а во вториот ред се печати 1 доколку цената за возење со првата компанија е 
помала или еднаква на цената на возење со втората компанија, се печати 0 инаку.

Пример: За влезот

13
6 7 4
4 2 1 2

Се добива дека првата компанија ќе наплати 6 + (13 - 7) * 4 = 30

Втората компанија ќе се наплати 2 + [13 / 4] * 1 + 13 * 2 = 31

For example:
Input: 5
       10 3 5
       1 5 1 2
Output: 20 20
        1
*/

#include <stdio.h>

int main() {
    int KilometriDoDestinacija;
    int C,K,P;
    int V,B,M,D;
    scanf("%d", &KilometriDoDestinacija);
    scanf("%d %d %d", &C, &K, &P);
    scanf("%d %d %d %d", &V, &B, &M, &D);
    int Kompanija1Cena;
    Kompanija1Cena = C + (KilometriDoDestinacija - K) * P;
    int Kompanija2Cena;
    Kompanija2Cena = B + (KilometriDoDestinacija/V) * M + KilometriDoDestinacija * D;
    printf("%d %d\n",Kompanija1Cena,Kompanija2Cena);
    if (Kompanija1Cena <= Kompanija2Cena)
    {
        printf("1");
    }
    else
        printf("0");
    return 0;
}
