/*
Пресметајте ја цената за електрична енергија која еден корисник треба да ја плати, во зависност од тоа колку kWh потрошил. За помалку 500 kWh се наплаќа 5 ден/kWh. 
Ако трошокот ја надмине оваа граница, тогаш за наредните 150 kWh се наплаќа 7.5 ден/kWh, за наредните 200 kWh се наплаќа 11 ден/kWh, а за секој трошок над тоа се 
доплаќа уште 13.5 ден/kWh. На крајот на сметката се додава 10% ДДВ доколку изнесува 7000 денари или помалку, додека ако изнесува повеќе од тоа, се додава 18% ДДВ.

For Example:
Input: 1000
Output: 9263.00
*/

#include <stdio.h>

int main()
{
    double Cena, sum=0;
    scanf("%lf", &Cena);

    if(Cena>=500)
    {
        sum+=5 * 500;
    }

    else
    {
        sum+=5 * Cena;
    }

    Cena-=500;

    if(Cena>0)
    {
        if(Cena>=150)
        {
            sum+=7.5 * 150;
        }

        else
        {
            sum+=7.5 * Cena;
        }
        Cena-=150;

        if(Cena>0)
        {
            if(Cena>=200)
            {
                sum+=11 * 200;
            }

            else
            {
                sum+=11 * Cena;
            }
            Cena-=200;

            if(Cena>0)
            {
                sum+=13.5 * Cena;
            }
        }
    }

    if(sum<7000)
    {
        sum*=1.10;
    }

    if(sum>7000)
    {
        sum*=1.18;
    }
    
    printf("%.2lf", sum);

    return 0;
}
