/*
Да се напише програма што ќе ја испечати сумата на сите броеви деливи со 3 во интервалот [A,B). А и B се внесуваат од тастатура.

Објаснување на примерот.
А=10, B = 20. Броеви кои припаѓаат во интервалот се 10,11,12,13,..,19. Од нив деливи со 3 се броевите 12,15,18, па нивната сума е 45. 

For example:
Input: 10 20
Output: 45
*/

#include <stdio.h>

int main()
{
    int a,b;
    int suma=0;

    scanf("%d %d",&a,&b);
  
    while (a<b)
    {
        a++;
      
        if(a%3==0)
        {
            suma+=a;
        }
    }
  
    printf("%d",suma);
    return 0;
}
