/*
Обидете се да креирате нов проект со една .с датотека и во неа внесете го текстот на следнава програма:
------------------------------------
#include <stdio.h>

int main() {
    printf("Zdravo, kako si?\n");
    return 0;
}
------------------------------------

  -Извршете ја програмата
  -Што добивате како резултат?
  
Доколку сте направиле грешка при пишувањето на текстот поправете и извршете уште еднаш. Направете намерно некоја грешка во текстот.
Извршете повторно!
Што се случува сега?
*/

#include <stdio.h>

int main() {
    printf("Zdravo, kako si?\n");
    return 0;
}

// Samo printa "Zdravo, kako si?"
