/*
Марко се движи по автопат. Во колата му преостануваат n цртки гориво, а колата на секој 100км троши една цртка. Целта на Марко е прво да
стигне до бензиската што е на m км оддалеченoст да наполни гориво(полни плус s цртички гориво),и после да продолжи до неговата дестинација 
што е на k км оддалеченост (секогаш е k>m). На влез се читаат вредностите n,s,m и k, а на излез се печати 1 ако Марко стигнал до дестинацијата, 
0 ако не стигнал, или -1 ако не стигнал воопшто до бензиската.

Пример: Марко  е оддалечен 300 км од бензиската и 700 км од дестинацијата. Ако Марко има 4 црти гориво, може да стигне до бензиската што е 300 км 
оддалечена и ќе му останат 1 црта гориво. На бензиската ќе наполни 2 црти гориво (Вкупно: 1+2 = 3 црти). Од бензиската до дестинацијата ќе му останат 
уште 400 км. Нема да има доволно гориво да стигне.

For Example:
Input: 4 2 300 700
Output: 0
*/

#include <stdio.h> //Ja kopirav ovaa zadaca od prof
int main(){
    int n,s,m,k;
    scanf("%d %d %d %d",&n, &s, &m, &k );
    int tmp = m/100;
    if(n >= tmp){
        n = n-tmp + s;
        int tmp1 = (k - m)/100;
        if(n >= tmp1){
            printf("1");
        }else{
            printf("0");
        }
    }else{
        printf("-1");
    }
}
