/*
Од стандарден влез се вчитуваaт три броја кои ги означуваат времињата (во минути) со кои три натпреварувачи истрчале 5км на Скопскиот маратон. 
Да се испечати редниот број на најбрзиот натпреварувач. Доколку најбрзо време имаат повеќе од еден натпреварувач, се печатат редните броеви на сите такви натпреварувачи.

For Example 1:
Input: 23 34 35.2
Output: 1

For Example 2:
Input: 20.1 20.1 20.5
Output: 12
*/

#include <stdio.h>
#include <stdlib.h>

int main()
{
    float a,b,c;
    scanf("%f %f %f",&a,&b,&c);

    if(a<=b && a<=c)
    {
        printf("1");
        if(a==b)
        {
            printf("2");
        }
        if (a==c)
        {
            printf("3");
        }
    }
    
    else if(b<=a && b<=c)
    {
        printf("2");
        if (b==c)
        {
            printf("3");
        }
    }
    
    else if(c<=a && c<=b)
    {
        printf("3");
    }

    return 0;
}
